Repository: Noname3123/FiditME
Catalog: fidit_me_jakupovic/lib/l10n/app_*.arb
Languages: hr

# oFakultetu
source: About the Faculty
hr: O fakultetu

# upisi
source: Enrollments
hr: Upisi

# studiji
source: Studies
hr: Studiji

# dinpPlanovi
source: Implementation plans
hr: Izvedbeni planovi

# postavke
source: Settings
hr: Postavke

# jezik
source: Language
hr: Jezik

source: Dark Mode
hr: Tamna tema

# uloga
source: Role
hr: Uloga

# ulogaUcenik
source: Student
hr: Učenik

# ulogaStudentPredd
source: Undergraduate Student
hr: Student preddiplomskog studija

# ulogaStudentDipl
source: Graduate Student
hr: Student diplomskog studija

# izaberiJezik
source: Select language
hr: Izaberi jezik

# primijeni
source: Apply
hr: Primijeni

# odustani
source: Cancel
hr: Zatvori

# izaberiUlogu
source: Select role
hr: Izaberi ulogu

# misija
source: Mission
hr: Misija

# misijaContent
source: The Faculty of Informatics and Digital Technologies is a component of the University of Rijeka, which directs its activities towards the achievement of the goals defined by the Development Strategy of the University of Rijeka through the cooperation and partnership relationship of all stakeholders with the aim of achieving new scientific knowledge, encouraging innovation and transfer of knowledge, guided by a clearly defined vision of the faculty.
hr: Fakultet informatike i digitalnih tehnologija sastavnica je Sveučilišta u Rijeci koja svoje djelovanje usmjerava ka ostvarivanju ciljeva definiranih Strategijom razvoja Sveučilišta u Rijeci kroz suradnju i partnerski odnos svih dionika s ciljem postizanja novih znanstvenih spoznaja, poticanja inovacija i prijenosa znanja, vodeći se pritom jasno definiranom vizijom fakulteta.

# vizija
source: Vision
hr: Vizija

# vizijaContent
source: We want to be a scientific institution with an international reputation that nurtures and encourages the highest academic values ​​of research and teaching work in the field of information sciences and computing in order to develop the economy and benefit society as a whole.
hr: Želimo biti znanstvena institucija s međunarodnom reputacijom koja njeguje i potiče najviše akademske vrijednosti istraživačkog i nastavnog rada na području informacijskih znanosti i računarstva u cilju razvoja gospodarstva i ostvarivanja dobrobiti društvu u cjelini.

# vrijednosti
source: Values
hr: Vrijednosti

# vrijednostiContent
source: 1. Promotion of scientific excellence and international visibility, but also appreciation of diversity within different areas of scientific and professional work. 2. Monitoring trends and new scientific knowledge to enable personal growth and development and competitiveness in the scientific and professional field. 3. Strengthening cooperation and connection of all human resources at the Faculty, including students, teachers, researchers, non-teaching staff and external collaborators, as a mechanism of stability, joint development, quality and progress. 4. Encouraging the development of the Faculty through cooperation with scientists in the country and abroad on scientific and professional projects. 5. Encouraging the development of the Faculty through interdisciplinarity and cooperation on scientific projects and teaching programs with scientists from other compatible fields of science. 6. Promotion of lifelong education and development of specialist studies. 7. Promotion of the STEM field and transfer of knowledge to the local community and cooperation with the economy.
hr: 1. Promicanje znanstvene izvrsnosti i međunarodne vidljivosti, ali i uvažavanje različitosti unutar različitih područja znanstvenog i stručnog rada. 2. Praćenje trendova i novih znanstvenih spoznaja kako bi se omogućio osobni rast i razvoj te kompetitivnost na znanstvenom i stručnom području. 3. Jačanje suradnje i povezivanja svih ljudskih potencijala na Fakultetu, uključujući studente, nastavnike, istraživače, nenastavno osoblje i vanjske suradnike, kao mehanizam stabilnosti, zajedničkog razvoja, kvalitete i napretka. 4. Poticanje razvoja Fakulteta kroz suradnju sa znanstvenicima u zemlji i inozemstvu na znanstvenim i stručnim projektima. 5. Poticanje razvoja Fakulteta kroz interdisciplinarnost i suradnju na znanstvenim projektima i nastavnim programima sa znanstvenicima iz drugih kompatibilnih područja znanosti. 6. Promicanje cjeloživotnog obrazovanja i razvoj specijalističkih studija. 7. Promocija STEM područja te transfer znanja lokalnoj zajednici i suradnja s gospodarstvom.

# osnovneInfo
source: Basic information & contact
hr: Osnovne informacije i kontakt

# adresa
source: Radmile Matejčić 2, 51000 Rijeka, Republic of Croatia
hr: Radmile Matejčić 2, 51000 Rijeka, Republika Hrvatska

# navigacijskiGumb
source: Directions to this place
hr: Otvori u Google Kartama

# semestar
source: Semester {broj}
hr: {broj}. Semestar

# izvedbeniPlanOpis
source: Implementation plans for the respective study subjects are available here.
hr: Ovdje su dostupni izvedbeni planovi za odgovarajuće predmete studija.

# dokumenti
source: {predmet, select, Matematika1{Mathematics 1} OsnoveProgramiranja{Basics of programming} OperacijskiSustavi{Operating systems} DubinskaAnalizaPodataka{InDepth data analysis} StrojnoiDubokoUcenje{Machine and deep learning} other{nedostupno}}
hr: {predmet, select, Matematika1{Matematika 1} OsnoveProgramiranja{Osnove programiranja} OperacijskiSustavi{Operacijski sustavi} DubinskaAnalizaPodataka{Dubinska analiza podataka} StrojnoiDubokoUcenje{Strojno i duboko učenje} NatjecajZaUpisUPrvuGodinuDiplomskog{Natječaj za upis u prvu godinu diplomskog studija} NatjecajZaUpisUPrvuGodinuPredDiplomskog{Natječaj za upis u prvu godinu prijediplomskog studija} OdlukaOUvjetimaUpisaUVisuGodinuStudija{Odluka o uvjetima upisa u višu godinu studija} PlanProgramPredDiplomskog{Plan i program sveučilišnog prijediplomskog studija informatika} PlanProgramDiplomskog{Plan i program sveučilišnog diplomskog studija informatika} other{nedostupno}}

# porukaDijeljenjaDokumenta
source: Sharing document {nazivDokumenta}
hr: Dijeljenje dokumenta {nazivDokumenta}
